# FailureMessageKey Operators

---
The FailureMessageKey type exposes the following members.
| Name| Description
---|---|---
| Equality(FailureMessageKey, FailureMessageKey)| Determines whether two FailureMessageKeys are the same.
| Inequality(FailureMessageKey, FailureMessageKey)| Determines whether two FailureMessageKeys are different.
Top
#### Reference
FailureMessageKey Class
Autodesk.Revit.DB Namespace